cfe llm/InformationRegisters/AI_АгентскиеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>AI_АгентскиеОперации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОперации</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДиалога</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователя</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.AI_СтатусАгентскойОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийЭтап</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Провайдер</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.AI_Провайдеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.AI_Модели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.AI_Агенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипAPI</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.AI_ТипAPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Промт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СистемныйПромт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеКонтекста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимДиалога</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлубинаДиалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредыдущийIDОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйIDОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФоновогоЗадания</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтменаЗапрошена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящиеТокены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыходящиеТокены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокеныИнструментов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнийНомерШага</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящиеТокеныВложений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыходящиеТокеныВложений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоВложений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfe llm/InformationRegisters/AI_ШагиАгентскихОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>AI_ШагиАгентскихОпераций</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОперации</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторШага</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерШага</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инструмент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьМс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аргументы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfe llm/Enums/AI_СтатусАгентскойОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>AI_СтатусАгентскойОперации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВОчереди</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаЗапрошена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfe llm/CommonModules/AI_АгентскиеОперации/Ext/Module.bsl
// Запускает агентский запрос в фоне и сразу возвращает идентификатор операции.
// В фон передается только UUID: все параметры уже сохранены в регистре.
Функция НачатьОперацию(ПараметрыОперации) Экспорт

	Провайдер = ПолучитьСвойство(ПараметрыОперации, "Провайдер", Справочники.AI_Провайдеры.ПустаяСсылка());
	Модель = ПолучитьСвойство(ПараметрыОперации, "Модель", Справочники.AI_Модели.ПустаяСсылка());
	ТипAPI = ПолучитьСвойство(ПараметрыОперации, "ТипAPI", Неопределено);
	Промт = ОбрезатьКраяСтроки(ПолучитьСвойство(ПараметрыОперации, "Промт", ""));
	СистемныйПромт = Строка(ПолучитьСвойство(ПараметрыОперации, "СистемныйПромт", ""));

	Если Не ЗначениеЗаполнено(Провайдер)
		Или Не ЗначениеЗаполнено(Модель)
		Или Не ЗначениеЗаполнено(ТипAPI)
		Или Не ЗначениеЗаполнено(Промт)
		Или Не ЗначениеЗаполнено(СистемныйПромт) Тогда
		ВызватьИсключение "Заполните провайдера, модель, тип API, системную инструкцию и сообщение.";
	КонецЕсли;

	ИдентификаторПользователя = ИдентификаторТекущегоПользователя();
	ИдентификаторДиалога = ПолучитьСвойство(
		ПараметрыОперации,
		"ИдентификаторДиалога",
		Новый УникальныйИдентификатор);
	Если Не ЗначениеЗаполнено(ИдентификаторДиалога) Тогда
		ИдентификаторДиалога = Новый УникальныйИдентификатор;
	КонецЕсли;

	АктивнаяОперация = НайтиАктивнуюОперацию(
		ИдентификаторДиалога,
		ИдентификаторПользователя);
	Если ЗначениеЗаполнено(АктивнаяОперация) Тогда
		ВызватьИсключение "В этом диалоге уже выполняется запрос. Дождитесь его завершения или отмените.";
	КонецЕсли;

	ИдентификаторОперации = Новый УникальныйИдентификатор;
	ИдентификаторСообщения = Новый УникальныйИдентификатор;
	Вложения = ПолучитьСвойство(ПараметрыОперации, "Вложения", Новый Массив);
	ТекущийМомент = ТекущаяДатаСеанса();
	НачатьТранзакцию();
	Попытка
		Запись = РегистрыСведений.AI_АгентскиеОперации.СоздатьМенеджерЗаписи();
		Запись.ИдентификаторОперации = ИдентификаторОперации;
		Запись.ИдентификаторДиалога = ИдентификаторДиалога;
		Запись.ИдентификаторСообщения = ИдентификаторСообщения;
		Запись.ИдентификаторПользователя = ИдентификаторПользователя;
		Запись.ДатаСоздания = ТекущийМомент;
		Запись.ДатаИзменения = ТекущийМомент;
		Запись.Статус = Перечисления.AI_СтатусАгентскойОперации.ВОчереди;
		Запись.ТекущийЭтап = "Ожидание фонового задания";
		Запись.Провайдер = Провайдер;
		Запись.Модель = Модель;
		Запись.Агент = ПолучитьСвойство(
			ПараметрыОперации,
			"Агент",
			Справочники.AI_Агенты.ПустаяСсылка());
		Запись.ТипAPI = ТипAPI;
		Запись.Промт = Промт;
		Запись.СистемныйПромт = СистемныйПромт;
		Запись.ДанныеКонтекста = Строка(ПолучитьСвойство(ПараметрыОперации, "ДанныеКонтекста", ""));
		Запись.РежимДиалога = ПолучитьСвойство(ПараметрыОперации, "РежимДиалога", Истина);
		Запись.ГлубинаДиалога = ПолучитьСвойство(ПараметрыОперации, "ГлубинаДиалога", 20);
		Запись.ПредыдущийIDОтвета = Строка(ПолучитьСвойство(ПараметрыОперации, "ПредыдущийIDОтвета", ""));
		Запись.ОтменаЗапрошена = Ложь;
		Запись.Версия = 1;
		Запись.ПоследнийНомерШага = 0;
		Запись.КоличествоВложений = AI_Вложения.ПривязатьКОперации(
			ИдентификаторОперации,
			ИдентификаторДиалога,
			ИдентификаторСообщения,
			Вложения);
		Запись.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

	ПараметрыЗадания = Новый Массив;
	ПараметрыЗадания.Добавить(ИдентификаторОперации);
	Попытка
		Задание = ФоновыеЗадания.Выполнить(
			"AI_АгентскиеОперацииСервер.ВыполнитьОперацию",
			ПараметрыЗадания,
			"AI_Агент_" + Строка(ИдентификаторДиалога),
			"Агентский запрос к данным базы");
		Запись.Прочитать();
		Запись.ИдентификаторФоновогоЗадания = Задание.УникальныйИдентификатор;
		Запись.ДатаИзменения = ТекущаяДатаСеанса();
		Запись.Версия = Запись.Версия + 1;
		Запись.Записать();
	Исключение
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Запись.Прочитать();
		Запись.Статус = Перечисления.AI_СтатусАгентскойОперации.Ошибка;
		Запись.ТекущийЭтап = "Не удалось запустить фоновое задание";
		Запись.ТекстОшибки = ТекстОшибки;
		Запись.ДатаИзменения = ТекущаяДатаСеанса();
		Запись.Версия = Запись.Версия + 1;
		Запись.Записать();
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;

	Возврат Новый Структура(
		"ИдентификаторОперации,ИдентификаторДиалога",
		ИдентификаторОперации,
		ИдентификаторДиалога);

КонецФункции

// Возвращает компактное состояние операции и только новые шаги после указанного номера.
Функция ПолучитьИзменения(ИдентификаторОперации, ПоследнийПолученныйШаг = 0) Экспорт

	ДанныеОперации = ПолучитьДанныеОперации(ИдентификаторОперации);
	ПроверитьВладельцаОперации(ДанныеОперации);
	Если ЗавершитьОтменуПоТаймауту(ИдентификаторОперации) Тогда
		ДанныеОперации = ПолучитьДанныеОперации(ИдентификаторОперации);
	КонецЕсли;

	Статус = ДанныеОперации.Статус;
	Финальная = Статус = Перечисления.AI_СтатусАгентскойОперации.Завершена
		Или Статус = Перечисления.AI_СтатусАгентскойОперации.Ошибка
		Или Статус = Перечисления.AI_СтатусАгентскойОперации.Отменена;

	Результат = Новый Структура;
	Результат.Вставить("ИдентификаторОперации", ИдентификаторОперации);
	Результат.Вставить("ИдентификаторДиалога", ДанныеОперации.ИдентификаторДиалога);
	Результат.Вставить("Статус", Статус);
	Результат.Вставить("ТекстСтатуса", Строка(Статус));
	Результат.Вставить("ТекущийЭтап", ДанныеОперации.ТекущийЭтап);
	Результат.Вставить("Финальная", Финальная);
	Результат.Вставить("Успешно", Статус = Перечисления.AI_СтатусАгентскойОперации.Завершена);
	Результат.Вставить("МожноОтменить", Не Финальная И Не ДанныеОперации.ОтменаЗапрошена);
	Результат.Вставить("Результат", ДанныеОперации.Результат);
	Результат.Вставить("ТекстОшибки", ДанныеОперации.ТекстОшибки);
	Результат.Вставить("НовыйIDОтвета", ДанныеОперации.НовыйIDОтвета);
	Результат.Вставить("ВходящиеТокены", ДанныеОперации.ВходящиеТокены);
	Результат.Вставить("ВыходящиеТокены", ДанныеОперации.ВыходящиеТокены);
	Результат.Вставить("ТокеныИнструментов", ДанныеОперации.ТокеныИнструментов);
	Результат.Вставить("ВходящиеТокеныВложений", ДанныеОперации.ВходящиеТокеныВложений);
	Результат.Вставить("ВыходящиеТокеныВложений", ДанныеОперации.ВыходящиеТокеныВложений);
	Результат.Вставить("КоличествоВложений", ДанныеОперации.КоличествоВложений);
	Результат.Вставить("Версия", ДанныеОперации.Версия);
	Результат.Вставить("ПоследнийНомерШага", ДанныеОперации.ПоследнийНомерШага);
	Результат.Вставить("Шаги", ПолучитьНовыеШаги(ИдентификаторОперации, ПоследнийПолученныйШаг));

	Возврат Результат;

КонецФункции

Процедура ЗапроситьОтмену(ИдентификаторОперации) Экспорт

	ДанныеОперации = ПолучитьДанныеОперации(ИдентификаторОперации);
	ПроверитьВладельцаОперации(ДанныеОперации);
	Если ЭтоФинальныйСтатус(ДанныеОперации.Статус) Тогда
		Возврат;
	КонецЕсли;

	Запись = РегистрыСведений.AI_АгентскиеОперации.СоздатьМенеджерЗаписи();
	Запись.ИдентификаторОперации = ИдентификаторОперации;
	Запись.Прочитать();
	Запись.ОтменаЗапрошена = Истина;
	Запись.Статус = Перечисления.AI_СтатусАгентскойОперации.ОтменаЗапрошена;
	Запись.ТекущийЭтап = "Ожидание безопасной точки остановки";
	Запись.ДатаИзменения = ТекущаяДатаСеанса();
	Запись.Версия = Запись.Версия + 1;
	Запись.Записать();

КонецПроцедуры

Функция ЗавершитьОтменуПоТаймауту(ИдентификаторОперации)

	Запись = РегистрыСведений.AI_АгентскиеОперации.СоздатьМенеджерЗаписи();
	Запись.ИдентификаторОперации = ИдентификаторОперации;
	Запись.Прочитать();
	Если Не Запись.ОтменаЗапрошена
		Или ЭтоФинальныйСтатус(Запись.Статус)
		Или Запись.ДатаИзменения > ТекущаяДатаСеанса() - 30 Тогда
		Возврат Ложь;
	КонецЕсли;

	Запись.Статус = Перечисления.AI_СтатусАгентскойОперации.Отменена;
	Запись.ТекущийЭтап = "Операция отменена пользователем";
	Запись.ТекстОшибки = "Операция отменена пользователем.";
	Запись.ДатаИзменения = ТекущаяДатаСеанса();
	Запись.Версия = Запись.Версия + 1;
	Запись.Записать();
	Возврат Истина;

КонецФункции

Функция НайтиАктивнуюОперациюДиалога(ИдентификаторДиалога) Экспорт

	Возврат НайтиАктивнуюОперацию(
		ИдентификаторДиалога,
		ИдентификаторТекущегоПользователя());

КонецФункции

Функция ПолучитьПоследнююАктивнуюОперациюПользователя() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		| 	Операции.ИдентификаторОперации КАК ИдентификаторОперации,
		| 	Операции.ИдентификаторДиалога КАК ИдентификаторДиалога,
		| 	Операции.Промт КАК Промт
		|ИЗ
		| 	РегистрСведений.AI_АгентскиеОперации КАК Операции
		|ГДЕ
		| 	Операции.ИдентификаторПользователя = &ИдентификаторПользователя
		| 	И Операции.Статус В (&ВОчереди, &Выполняется, &ОтменаЗапрошена)
		|УПОРЯДОЧИТЬ ПО
		| 	Операции.ДатаСоздания УБЫВ";
	Запрос.УстановитьПараметр(
		"ИдентификаторПользователя",
		ИдентификаторТекущегоПользователя());
	Запрос.УстановитьПараметр("ВОчереди", Перечисления.AI_СтатусАгентскойОперации.ВОчереди);
	Запрос.УстановитьПараметр("Выполняется", Перечисления.AI_СтатусАгентскойОперации.Выполняется);
	Запрос.УстановитьПараметр("ОтменаЗапрошена", Перечисления.AI_СтатусАгентскойОперации.ОтменаЗапрошена);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат Новый Структура(
		"ИдентификаторОперации,ИдентификаторДиалога,Промт",
		Выборка.ИдентификаторОперации,
		Выборка.ИдентификаторДиалога,
		Выборка.Промт);

КонецФункции

Функция ПолучитьДанныеОперации(ИдентификаторОперации)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		| 	Операции.ИдентификаторДиалога КАК ИдентификаторДиалога,
		| 	Операции.ИдентификаторПользователя КАК ИдентификаторПользователя,
		| 	Операции.Статус КАК Статус,
		| 	Операции.ТекущийЭтап КАК ТекущийЭтап,
		| 	Операции.ОтменаЗапрошена КАК ОтменаЗапрошена,
		| 	Операции.Результат КАК Результат,
		| 	Операции.ТекстОшибки КАК ТекстОшибки,
		| 	Операции.НовыйIDОтвета КАК НовыйIDОтвета,
		| 	Операции.ВходящиеТокены КАК ВходящиеТокены,
		| 	Операции.ВыходящиеТокены КАК ВыходящиеТокены,
		| 	Операции.ТокеныИнструментов КАК ТокеныИнструментов,
		| 	Операции.ВходящиеТокеныВложений КАК ВходящиеТокеныВложений,
		| 	Операции.ВыходящиеТокеныВложений КАК ВыходящиеТокеныВложений,
		| 	Операции.КоличествоВложений КАК КоличествоВложений,
		| 	Операции.Версия КАК Версия,
		| 	Операции.ПоследнийНомерШага КАК ПоследнийНомерШага
		|ИЗ
		| 	РегистрСведений.AI_АгентскиеОперации КАК Операции
		|ГДЕ
		| 	Операции.ИдентификаторОперации = &ИдентификаторОперации";
	Запрос.УстановитьПараметр("ИдентификаторОперации", ИдентификаторОперации);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		ВызватьИсключение "Агентская операция не найдена.";
	КонецЕсли;
	Возврат Выборка;

КонецФункции

Функция ПолучитьНовыеШаги(ИдентификаторОперации, ПоследнийПолученныйШаг)

	МинимальныйНомерШага = ?(ПоследнийПолученныйШаг > 0, ПоследнийПолученныйШаг, 1);

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		| 	Шаги.ИдентификаторШага КАК ИдентификаторШага,
		| 	Шаги.ПорядковыйНомер КАК ПорядковыйНомер,
		| 	Шаги.НомерШага КАК НомерШага,
		| 	Шаги.Инструмент КАК Инструмент,
		| 	Шаги.Статус КАК Статус,
		| 	Шаги.ДатаНачала КАК ДатаНачала,
		| 	Шаги.ДатаОкончания КАК ДатаОкончания,
		| 	Шаги.ДлительностьМс КАК ДлительностьМс,
		| 	Шаги.Аргументы КАК Аргументы,
		| 	Шаги.Результат КАК Результат
		|ИЗ
		| 	РегистрСведений.AI_ШагиАгентскихОпераций КАК Шаги
		|ГДЕ
		| 	Шаги.ИдентификаторОперации = &ИдентификаторОперации
		| 	И Шаги.ПорядковыйНомер >= &МинимальныйНомерШага
		|УПОРЯДОЧИТЬ ПО
		| 	ПорядковыйНомер";
	Запрос.УстановитьПараметр("ИдентификаторОперации", ИдентификаторОперации);
	Запрос.УстановитьПараметр("МинимальныйНомерШага", МинимальныйНомерШага);

	Шаги = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Шаги.Добавить(Новый Структура(
			"ИдентификаторШага,ПорядковыйНомер,НомерШага,Инструмент,Статус,ДатаНачала,ДатаОкончания,ДлительностьМс,Аргументы,Результат",
			Выборка.ИдентификаторШага,
			Выборка.ПорядковыйНомер,
			Выборка.НомерШага,
			Выборка.Инструмент,
			Выборка.Статус,
			Выборка.ДатаНачала,
			Выборка.ДатаОкончания,
			Выборка.ДлительностьМс,
			Выборка.Аргументы,
			Выборка.Результат));
	КонецЦикла;
	Возврат Шаги;

КонецФункции

Функция НайтиАктивнуюОперацию(ИдентификаторДиалога, ИдентификаторПользователя)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		| 	Операции.ИдентификаторОперации КАК ИдентификаторОперации
		|ИЗ
		| 	РегистрСведений.AI_АгентскиеОперации КАК Операции
		|ГДЕ
		| 	Операции.ИдентификаторДиалога = &ИдентификаторДиалога
		| 	И Операции.ИдентификаторПользователя = &ИдентификаторПользователя
		| 	И Операции.Статус В (&ВОчереди, &Выполняется, &ОтменаЗапрошена)
		|УПОРЯДОЧИТЬ ПО
		| 	Операции.ДатаСоздания УБЫВ";
	Запрос.УстановитьПараметр("ИдентификаторДиалога", ИдентификаторДиалога);
	Запрос.УстановитьПараметр("ИдентификаторПользователя", ИдентификаторПользователя);
	Запрос.УстановитьПараметр("ВОчереди", Перечисления.AI_СтатусАгентскойОперации.ВОчереди);
	Запрос.УстановитьПараметр("Выполняется", Перечисления.AI_СтатусАгентскойОперации.Выполняется);
	Запрос.УстановитьПараметр("ОтменаЗапрошена", Перечисления.AI_СтатусАгентскойОперации.ОтменаЗапрошена);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.ИдентификаторОперации, Неопределено);

КонецФункции

Процедура ПроверитьВладельцаОперации(ДанныеОперации)

	Если ДанныеОперации.ИдентификаторПользователя <> ИдентификаторТекущегоПользователя() Тогда
		ВызватьИсключение "Агентская операция принадлежит другому пользователю.";
	КонецЕсли;

КонецПроцедуры

Функция ИдентификаторТекущегоПользователя()

	Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	Возврат Пользователь.УникальныйИдентификатор;

КонецФункции

Функция ПолучитьСвойство(Данные, ИмяСвойства, ЗначениеПоУмолчанию)

	ЗначениеСвойства = Неопределено;
	Если Данные <> Неопределено И Данные.Свойство(ИмяСвойства, ЗначениеСвойства) Тогда
		Возврат ЗначениеСвойства;
	КонецЕсли;
	Возврат ЗначениеПоУмолчанию;

КонецФункции

Функция ОбрезатьКраяСтроки(Текст)

	Результат = Строка(Текст);
	Пока СтрДлина(Результат) > 0 Цикл
		ПервыйСимвол = Лев(Результат, 1);
		Если ПервыйСимвол <> " " И ПервыйСимвол <> Символ(9) Тогда
			Прервать;
		КонецЕсли;
		Результат = Сред(Результат, 2);
	КонецЦикла;
	Пока СтрДлина(Результат) > 0 Цикл
		ПоследнийСимвол = Прав(Результат, 1);
		Если ПоследнийСимвол <> " " И ПоследнийСимвол <> Символ(9) Тогда
			Прервать;
		КонецЕсли;
		Результат = Лев(Результат, СтрДлина(Результат) - 1);
	КонецЦикла;
	Возврат Результат;

КонецФункции

Функция ЭтоФинальныйСтатус(Статус)

	Возврат Статус = Перечисления.AI_СтатусАгентскойОперации.Завершена
		Или Статус = Перечисления.AI_СтатусАгентскойОперации.Ошибка
		Или Статус = Перечисления.AI_СтатусАгентскойОперации.Отменена;

КонецФункции
